Repository: thidarnyein89/Synpitarn
Catalog: lib/l10n/app_*.arb
Languages: my, th

source: Additional Documents
my: ထပ်ဆောင်းစာရွက်စာတမ်းများ
th: เอกสารเพิ่มเติม

source: Additional Information
my: ထပ်ဆောင်းအချက်အလက်
th: ข้อมูลเพิ่มเติม

source: Agree Term & Condition
my: သဘောတူလက်ခံပါသည်
th: ยอมรับข้อตกลงและเงื่อนไข

source: Amount
my: ပမာဏ
th: จำนวนเงิน

source: Apply
my: အကောင့်ဖွင့်၍ ချေးငွေလျှောက်ခြင်း
th: สมัครและยื่นขอสินเชื่อ

source: Apply Loan
my: ချေးငွေလျှောက်ထားခြင်း
th: การขอสินเชื่อครั้งที่ {loanNumber}

# applyLoanButton
source: Apply Loan
my: အကောင့်ဖွင့်၍ ချေးငွေလျှောက်ရန်
th: สมัครขอสินเชื่อ สมัครสินเชื่อด้วยบัญชีที่เปิดอยู่

source: Appointment Branch
my: ရက်ချိန်းဌာနခွဲ
th: สาขาที่จะเข้ามา

source: Appointment Date
my: ချိန်းဆိုသည့်နေ့ရက်
th: วันที่นัด

# appointmentSuccess1
source: Thank you for submitting your loan application form.
my: သင်၏ ချေးငွေလျှောက်လွှာကို ပို့ပေးခြင်းအတွက် ကျေးဇူးတင်ပါသည်။
th: ขอบคุณที่สมัครสินเชื่อกับเรา

# appointmentSuccess2
source: Syn Pitarn staff are reviewing your loan application. We may have to contact you to re-upload any document that is not clear. The next step is for you to have a quick video call with our staff at the time and date you previously selected.
my: ကျွန်ပ်တို့၏ ဝန်ထမ်းများမှ သင်၏ ချေးငွေလျှောက်လွှာကို စစ်ဆေးနေပါသည်။ အကယ်၍သင်တင်ထားသော စာရွက်စာတမ်းများတွင် အဆင်မပြေမှုရှိခဲ့ပါက ပြန်လည်ပြင်ဆင်ရန် ဆက်သွယ်လိုက်ပါမည်။နောက်တဆင့်အနေဖြင့် သင်ရွေးချယ်ထားသော နေ့ရက်နှင့်အချိန်တွင် ကျွန်ုပ်တို့မှ Video Call ဖြင့်ဆက်သွယ်ပါမည်။
th: พนักงานของเราอยู่ระหว่างตรวจสอบความครบถ้วนของเอกสาร อาจมีการติดต่อคุณเพื่อขอให้อัพโหลดเอกสารอีกครั้งหากเอกสารไม่ชัดเจน ขั้นตอนต่อไปจะเป็นการสัมภาษณ์สั้นๆทางวิดีโอคอลโดยพนักงานของเรา ตามวันและเวลาที่คุณเลือก

# appointmentTime
source: Available time
my: ချိန်းဆိုသည့်အချိန်
th: ช่วงเวลาที่สะดวก

source: Appointment Information
my: ရက်ချိန်းအချက်အလက်များ
th: รายละเอียดการนัดหมาย

source: Approved Loan
my: အတည်ပြုပြီးသော ချေးငွေ
th: อนุมัติสินเชื่อ

# bahts
source: Baht
my: ဘတ်
th: บาท

source: Basic Information
my: အခြေခံအချက်အလက်
th: ข้อมูลพื้นฐาน

source: Branch Appointment
my: ဆင်ပိတန် ရုံးခွဲသို့သွားရန် ချိန်းဆိုခြင်း
th: การนัดหมายเพื่อไปที่สาขา Sinpyitan

source: Call Center
my: ဝန်ဆောင်မှုဌာန
th: คอลเซ็นเตอร์

# callMobile
source: Call us on mobile
my: ဖုန်းဖြင့်ဆက်သွယ်ပါ
th: โทรหาเราทางมือถือ

# callMobileButton
source: Call Centre
my: ဖုန်းဆက်ရန်
th: ศูนย์บริการลูกค้า

source: Cancel
my: ပယ်ဖျက်သည်
th: ยกเลิก

# canNotCallPhone
source: Cannot launch phone dialer
my: ဖုန်းခေါ်ဆို၍မရပါ
th: ไม่สามารถโทรออกได้

# canNotOpenMessenger
source: Could not launch Messenger
my: Messenger ဖွင့်လို့မရပါ
th: ไม่สามารถเปิด Messenger ได้

source: Change Language
my: ဘာသာစကားပြောင်းရန်
th: เปลี่ยนภาษา

source: Change Phone Number
my: ဖုန်းနံပါတ်ပြင်ရန်
th: เปลี่ยนหมายเลขโทรศัพท์

source: Citizen
my: နိုင်ငံသား
th: สัญชาติ

source: click here
my: စာရင်းသွင်းပါ
th: คลิกที่นี่เพื่อสมัครสมาชิก

source: Complete
my: ပေးချေပြီးပါပြီ
th: ชำระเงินแล้ว

# confirmDeleteImage
source: Are you sure to delete this image?
my: ဓာတ်ပုံ သို့မဟုတ် PDFဖိုင်ကို ဖျက်ရန်သေချာပါသလား
th: คุณแน่ใจหรือไม่ว่าต้องการลบรูปภาพหรือไฟล์ PDF นี้?

# confirmOk
source: Ok
my: သေချာသည်
th: แน่ใจ

source: Confirm PIN
my: လျှို့ဝှက် PIN အတည်ပြုခြင်း
th: ยืนยันรหัส PIN

# continueText
source: Continue
my: ဆက်လက်၍
th: ถัดไป

source: Contract No
my: ချေးငွေလျှောက်လွှာ
th: เลขที่สัญญา

source: Current Apply Loan
my: လက်ရှိ ချေးငွေလျှောက်ထားခြင်း
th: การสมัครขอสินเชื่อในปัจจุบัน

source: Current Phone Number
my: လက်ရှိ ဖုန်းနံပါတ်
th: หมายเลขโทรศัพท์ปัจจุบัน

source: Customer Information
my: ကိုယ်ရေးအချက်အလက်
th: ข้อมูลโปรไฟล์

source: Disbursed
my: ချေးငွေထုတ်ချေးခြင်း
th: การเบิกจ่ายเงินกู้

# dob
source: Date of Birth
my: မွေးနေ့
th: ปีเกิด

# doHaveAnAccount
source: Do you have an account,
my: အကောင့်ရှိသလား?
th: มีบัญชีอยู่แล้วหรือไม่?

# doNotHaveAnAccount
source: Don't have an account,
my: အကောင့်မရှိသေးဘူးလား?
th: ยังไม่มีบัญชีใช่ไหม?

source: Documents
my: စာရွက်စာတမ်းများ
th: เอกสาร

# documentRequestMessage
source: We are sorry to inform you that your loan information needs updated information. Please update your information.
my: ကျေးဇူးပြု၍ သင်၏စာရွက်စာတမ်းများကို အသစ်ပြန်တင်ပေးပါ။
th: เราเสียใจที่ต้องแจ้งให้คุณทราบว่าข้อมูลสินเชื่อของคุณจำเป็นต้องมีข้อมูลที่อัปเดต โปรดอัปเดตข้อมูลของคุณ

source: Download
my: ဒေါင်းလုဒ်ရန်
th: ดาวน์โหลด

# downloadComplete
source: Download completed
my: ဒေါင်းလုဒ်ပြီးဆုံးပါပြီ
th: ดาวน์โหลดเสร็จสิ้นแล้ว

source: Downloading...
my: ဒေါင်းလုဒ်ဆွဲနေသည်...
th: กำลังดาวน์โหลด...

source: Due Date
my: ပေးချေရမည့်နေ့
th: วันกำหนดชำระ

source: Branch Appointment Date
my: ဆင်ပိတန် ရုံးခွဲသို့သွားရန် ချိန်းဆိုထားသော နေ့ရက်
th: วันที่เข้าสาขา

source: Branch Appointment Time
my: ဆင်ပိတန် ရုံးခွဲသို့သွားရန် ချိန်းဆိုထားသော အချိန်
th: เวลาที่เข้าสาขา

source: Branches
th: สาขา

source: Existing User?
my: သင့်အကောင့်ထဲဝင်ရန်
th: เข้าสู่ระบบ

source: Edit Information
my: အချက်အလက်များပြင်ဆင်ခြင်း
th: การแก้ไขข้อมูล

# editInformationButton
source: Edit Information
my: အချက်အလက်များပြင်ဆင်ရန်
th: เพื่อแก้ไขข้อมูล

source: First Payment Date
my: ပထမဆုံးအကြိမ် ငွေပြန်လည်ပေးချေရမည့် ရက်စွဲ
th: วันที่ชำระเงินครั้งแรก

source: Forgot PIN code
my: စကားဝှက်မေ့နေပါသလား
th: ลืมรหัสผ่าน

source: Get to know us
my: ကျွန်ုပ်တို့အကြောင်းသိရှိရန်
th: รู้จักสินพิธาน

source: Got it
my: နားလည် သဘောပေါက်သည်
th: รับทราบ

source: Go To Home Page
my: မူလစာမျက်နှာသို့သွားရန်
th: ไปที่หน้าแรก

source: Go To Direction
th: ไปที่ทิศทาง

# helpAndSupport
source: Help & Support
my: App လမ်းညွှန်
th: แผนที่

source: Home
my: မူလစာမျက်နှာ
th: หน้าแรก

# howToApplyLoan
source: How To Apply For A Loan
my: ချေးငွေလျှောက်ထားခြင်းအဆင့်များ
th: ขั้นตอนการขอเงินกู้

# incomeType
source: How often are you paid
my: သင်၏လုပ်ခလစာ ဘယ်နှစ်ကြိမ် ရရှိပါသလဲ
th: คุณได้รับรายได้บ่อยแค่ไหน

source: Interview
my: အင်တာဗျူးဖြေဆိုခြင်း
th: การสัมภาษณ์

source: Interview Appointment
my: အင်တာဗျူးရက်ချိန်း
th: การนัดสัมภาษณ์

# interviewAppointmentButton
source: Resubmit Interview Appointment
my: အင်တာဗျူးရက်ချိန်း ပြန်လည်ပြုလုပ်မည်
th: ส่งคำขอนัดสัมภาษณ์อีกครั้ง

# interviewAppointmentDate
source: Appointment date
my: ချိန်းဆိုသည့်နေ့ရက်
th: วันที่นัด

# interviewAppointmentTime
source: Available time
my: ချိန်းဆိုသည့်အချိန်
th: ช่วงเวลาที่สะดวก

# interviewAppointmentMessage
source: You need to take interview appointment again
my: အင်တာဗျူးရက်ချိန်း ထပ်မံပြုလုပ်ရန် လိုအပ်ပါသည်
th: คุณจำเป็นต้องนัดสัมภาษณ์อีกครั้ง

source: Last Payment Date
my: နောက်ဆုံးအကြိမ် ငွေပြန်လည်ပေးချေရမည့် ရက်စွဲ
th: วันที่ชำระเงินล่าสุด

# lengthTimeCurrentEmployer
source: Length of time at current employer
my: ယခုလက်ရှိလုပ်ကိုင်နေသည့်လုပ်ငန်းတွင် လုပ်သက်ကြာချိန်
th: ปีที่เข้ามาทำงานในประเทศไทย

source: Loan
my: ချေးငွေ
th: เงินกู้

source: Loan Application
my: ချေးငွေလျှောက်လွှာ
th: การสมัครสินเชื่อ

source: Loan Applied Date
my: ချေးငွေလျောက်ထားသောနေ့ရက်
th: วันที่ขอกู้

source: Loan Information
my: ချေးငွေအချက်အလက်များ
th: รายละเอียดเงินกู้

source: Loan Schedule
my: ချေးငွေလုပ်ငန်းစဥ်အချိန်ဇယား
th: ตารางเวลาการให้กู้ยืม

source: Loan Size
my: ချေးငွေပမာဏ
th: จำนวนเงินที่กู้

source: Loan Status
my: ချေးငွေအခြေအနေ
th: สถานะเงินกู้

source: Loan Term
my: ချေးငွေသက်တမ်း
th: ระยะเวลาในการกู้

source: Loan Type
my: ချေးငွေအမျိုးအစား
th: ประเภทเงินกู้

source: Location
my: တည်နေရာ
th: พื้นที่ให้บริการ

# login
source: Existing User?
my: သင့်အကောင့်ထဲဝင်ရန်
th: เข้าสู่ระบบ

source: Logout
my: အကောင့်မှထွက်ရန်
th: ออกจากระบบ

source: Make Appointment
my: ရက်ချိန်းပြုလုပ်ပါ
th: นัดหมายวันเข้าสาขา

# mainPurposeLoan
source: Main purpose of loan
my: ချေးငွေလိုချင်သည့်အဓိကရည်ရွယ်ချက်
th: จุดประสงค์ในการนำเงินกู้ไปใช้

source: Manual Fill
my: ကိုယ်တိုင်ဖြည့်စွက်မည်
th: ကိုယ်တိုင်ဖြည့်စွက်မည်

source: Months
my: လ
th: เดือน

source: Name
my: နာမည်
th: ชื่อ

source: Nearest ATM
my: အနီးဆုံး ATM
th: เอทีเอ็มใกล้ฉัน

source: Nearest Branch
my: အနီးဆုံးရုံးခွဲ
th: สาขาใกล้ฉัน

# noAdditionalDocuments
source: There is no additional documents.
my: ထပ်ဆောင်းစာရွက်စာတမ်းများ မရှိပါ။
th: ไม่มีเอกสารเพิ่มเติม

# noApplyLoan
source: There is no apply loan
my: ချေးငွေလျှောက်ထားခြင်းမရှိပါ
th: ไม่มีการยื่นขอสินเชื่อ

source: No file selected
my: ဖိုင်မရွေးရသေးပါ
th: ยังไม่ได้เลือกไฟล์

# noRepaymentSchedule
source: There is no current repayment schedule
my: လက်ရှိပေးဆောင်ရမည့်အစီအစဉ်မရှိပါ
th: ไม่มีตารางการชำระเงินในปัจจุบัน

# notification
source: Notifications
my: အသိပေးသော အချက်များ
th: การแจ้งเตือน

# notificationNothing
source: There is no notification.
my: အသိပေးသော အချက်များ မရှိပါ။
th: ไม่มีการแจ้งเตือน

source: NRC Number
my: မှတ်ပုံတင်အမှတ်
th: บัตรประจำตัวประชาชน

source: Ok
my: ပိတ်မည်
th: จะปิด

# openAccount
source: Apply Loan with open account
my: အကောင့်ဖွင့်၍ ချေးငွေလျှောက်ရန်
th: สมัครขอสินเชื่อ สมัครสินเชื่อด้วยบัญชีที่เปิดอยู่

source: OR
my: သို့မဟုတ်
th: หรือ

# otpCodeContent
source: Please enter the 6 digits number that we have sent to you here then click "Verify OTP Code" below.
my: ပို့ပေးသော ဂဏန်း ၆ လုံးကို ထည့်သွင်း၍ ကျေးဇူးပြုပြီး အောက်တွင်ရှိသော "အတည်ပြု" ကို နှိပ်ပါ။
th: โปรดกรอกตัวเลข 6 หลักที่คุณได้รับทางข้อความผ่านเบอร์โทรศัพท์ จากนั้นเลือกปุ่ม "ยืนยัน" ด้านล่าง

# otpExpireMessage
source: OTP Code will expire in {minutes}:{seconds}
my: OTP ကုဒ်သည် {minutes}:{seconds} မိနစ်တွင် သက်တမ်းကုန်မည်ဖြစ်သည်။
th: รหัสผ่านแบบใช้ครั้งเดียวจะหมดอายุภายใน {minutes}:{seconds} นาที

source: OTP not received?
my: OTP မရရှိဘူးလား?
th: ยังไม่ได้รับรหัส OTP ใช่ไหม?

source: Passport
my: ပတ်စ်ပိုစ့်နံပါတ်
th: หนังสือเดินทาง

source: Pay Now
my: ပေးချေရန်
th: ชำระเงิน

source: Payment at ATM
my: ATM တွင်ငွေပေးချေမှု
th: ชำระที่ตู้เอทีเอ็มหรือ แอพพลิเคชั่น

# paymentAtOnline
source: Payment via mobile banking
my: Mobile bankingမှ ပြန်လည်ပေးချေရန်
th: ชำระผ่านแอพพลิเคชั่นธนาคาร

# pendingLoan
source: Pending Loan Application
my: စစ်ဆေးဆဲချေးငွေလျှောက်လွှာ
th: เงินกู้รอการพิจารณา

source: Phone number
my: ဖုန်းနံပါတ်
th: เบอร์โทรศัพท์

source: PIN
my: လျို့ဝှက် PIN နံပါတ်
th: รหัสผ่าน

source: Please Wait...
my: ကျေးဇူးပြု၍ ခဏစောင့်ပါ...
th: กรุณารอสักครู่...

# postponedLoan
source: Your loan has been postponed
my: သင်၏ချေးငွေလျှောက်လွှာ ယာယီ‌ရွှေ့ဆိုင်းထားပါသည်
th: ใบสมัครสินเชื่อของคุณถูกเลื่อนออกไป

source: Pre-approved
my: ချေးငွေကြိုတင်အတည်ပြုခြင်း
th: การอนุมัติเบื้องต้น

source: Pre Approved Loan
my: ကြိုတင်အတည်ပြုပြီးသော ချေးငွေ
th: เงินกู้อนุมัติเบื้องต้น

source: Previous
my: ယခင်က
th: ย้อนกลับ

source: Profile
my: ကိုယ်ရေးအကျဉ်း
th: โปรไฟล์

# provinceResidence
source: Province of residence
my: သင်နေထိုင်ရာ ခရိုင်မြို့နယ်
th: จังหวัดที่อาศัยอยู่

# provinceWork
source: Province of work
my: အလုပ်လုပ်ကိုင်သည့် ခရိုင်မြို့နယ်
th: จังหวัดที่ทำงานอยู่

# reachOnline
source: Reach us online
my: အွန်လိုင်းကဆက်သွယ်ပါ
th: ติดต่อเราทางออนไลน์

# rejectedMessage1
source: We are sorry to say that your loan application is rejected
my: သင်၏ ချေးငွေလျှောက်လွှာသည် ပယ်ချခံရပါသည်
th: ขออภัยที่ต้องแจ้งให้ทราบว่าใบสมัครสินเชื่อของคุณถูกปฏิเสธ

# rejectedMessage2
source: Thank you for your application. We have reviewed but your qualification does not meet our criteria
my: သင့်၏ လျှောက်လွှာအတွက် ကျေးဇူးတင်ပါသည်။ ကျွန်ုပ်တို့က စစ်ဆေးပြီးဖြစ်ပါသည်။ သို့သော် သင့်အရည်အချင်းသည် ကျွန်ုပ်တို့၏ အထူးအကဲဖြတ်ချက်များနှင့် မကိုက်ညီပါ။
th: ขอขอบคุณสำหรับการสมัครของคุณ เราได้ตรวจสอบแล้ว แต่คุณสมบัติของคุณไม่ตรงตามเกณฑ์ของเรา

# rejectedMessage3
source: Sorry, you can’t request another loan currently. But don’t worry, you can request again on
my: သင်သည် လောလောဆယ်တွင် အခြားချေးငွေကို မတောင်းဆိုနိုင်ပါ။ နောက်ထပ်ချေးငွေကို
th: ขออภัย ตอนนี้คุณไม่สามารถขอสินเชื่ออื่นได้ แต่ไม่ต้องกังวล คุณสามารถขอใหม่ได้ในวันที่

# rememberPhonePincode1
source: Please remember your phone number which is your username
my: သင်၏ Username မှာ သင့်ဖုန်းနံပါတ်
th: โปรดบันทึกเบอร์โทรศัพท์ของคุณซึ่งจะเป็นชื่อผู้ใช้ของคุณ

# rememberPhonePincode2
source: and your PIN code
my: ဖြစ်ပါသည်။ သင်၏ PIN Code မှာ
th: และรหัสผ่านคือตัวเลข 6 หลัก โปรดบันทึกไว้เพื่อเข้าสู่ระบบในครั้งต่อ ๆ ไป

source: Repayment
my: ငွေပြန်လည်ပေးချေမှု
th: การชำระคืน

# repayAtBranch
source: Repay at a branch
my: ရုံးဌာနခွဲတွင် ပြန်လည်ပေးချေပါ။
th: ชำระที่สาขา

source: Repayment amount
my: ငွေပြန်လည်ပေးချေရမည့် ပမာဏ
th: ชำระต่องวด

source: Repayment date
my: ငွေပြန်လည်ပေးချေမည့် ရက်စွဲ
th: วันชำระรอบถัดไป

# repaymentLateDay
source: Your repayment is {totalLateDay} days late.
my: သင်၏ ငွေပြန်လည်ပေးချေမှုသည် {totalLateDay} ရက် နောက်ကျနေပါသည်။
th: การชำระเงินของคุณล่าช้า {totalLateDay} วัน

# repaymentLateDescription1
source: Your repayment is now {para1} days late. Please make a payment of {para2} immediately or click
my: သင်၏ ငွေပြန်လည်ပေးချေမှုသည် {para1} ရက် နောက်ကျနေပါသည်။ ကျေးဇူးပြု၍ {para2} ကို ချက်ချင်းပြန်လည် ပေးသွင်းပါ။ သို့မဟုတ်
th: การชำระเงินของคุณล่าช้าไปแล้ว {para1} วัน กรุณาชำระเงินจำนวน {para2} บาททันที หรือ

# repaymentLateDescription2
source: here (messenger link)
my: ဤနေရာကိုနှိပ်၍
th: คลิกที่นี่

# repaymentLateDescription3
source: to contact your loan officer
my: ကျွန်ုပ်တို့နှင့် ဆက်သွယ်ပါ။
th: เพื่อติดต่อเจ้าหน้าที่สินเชื่อของคุณ

# repaymentLateMessage
source: Please make a payment to maintain good credit.
my: ကျေးဇူးပြု၍ ငွေပေးချေပါ။
th: กรุณาชำระเงินเพื่อรักษาประวัติเครดิตที่ดี

source: Repayment Schedule
my: ငွေပြန်လည်ပေးချေမှု အချိန်ဇယား
th: ตารางชำระคืนเงินกู้

source: Repayment Term
my: ချေးငွေပေးဆပ်မည့်အကြိမ်
th: เงื่อนไขการชำระคืน

source: Request Interview Date
my: တောင်းဆိုထားသော အင်တာဗျူးရက်စွဲ
th: วันสัมภาษณ์ที่ผู้กู้เลือก

source: Request Interview Time
my: တောင်းဆိုထားသော အင်တာဗျူးအချိန်
th: เวลาสัมภาษณ์ที่ผู้กู้เลือก

source: Required Documents
my: လိုအပ်သောစာရွက်စာတမ်းများ
th: เอกสารที่จำเป็น

source: Resend OTP Code
my: OTP ကုဒ်ကို ပြန်ပို့ပေးပါ။
th: ขอรหัสผ่านแบบใช้ครั้งเดียวอีกครั้ง

source: Reset PIN code
my: သင်၏ လျို့ဝှက် PIN နံပါတ်ကို ပြန်လည်ပြင်ဆင်ရန်
th: รีเซ็ตรหัสผ่าน

# reUploadMsg1
source: We found out that your
my: သင်တင်ထားသော
th: เราพบว่าไฟล์

# reUploadMsg2
source: is blurred and we would like you to upload that document again for your loan application.
my: တို့မှာ ကြည်လင်ပြတ်သားမှုမရှိပါသဖြင့် ကြည်လင်ပြတ်သားသော ပုံအသစ်ပြန်တင်ပေးပါ။
th: ของคุณไม่ชัดเจน และเราต้องการให้คุณอัปโหลดเอกสารนั้นอีกครั้งสำหรับการสมัครสินเชื่อของคุณ

source: Reupload Request
my: စာရွက်စာတမ်း အသစ်ပြန်တင်ရန်
th: คำขออัปโหลดซ้ำ

# salary
source: Total income (Salary + Overtime + Other Income) (Baht)
my: စုစုပေါင်းဝင်ငွေ (လစာ + အချိန်ပိုကြေး + အခြားဝင်ငွေ) (ဘတ်)
th: รายรับต่อครั้ง รวมเงินเดือน ค่าล่วงเวลาและรายได้อื่น (บาท)

source: Send Message
my: စာပို့ရန်
th: ส่งข้อความ

source: Set New Password
my: စကားဝှက်အသစ် သတ်မှတ်ပါ
th: ตั้งรหัสผ่านใหม่

# setPincode
source: Set Your Pin Code
my: သင့် PIN နံပါတ်ကို သတ်မှတ်ပါ
th: ตั้งรหัสผ่าน

source: Setting
my: ဆက်တင်
th: การตั้งค่า

source: State
my: ပြည်နယ်
th: รัฐ

source: Status
my: အခြေအနေ
th: สถานะ

source: Social media channel
my: ဆိုရှယ်မီဒီယာ ချက်နယ်
th: ช่องทางโซเชียลมีเดีย

source: Social Media Url
my: ဆိုရှယ်မီဒီယာဝက်ဆိုဒ်လိပ်စာ
th: ลิงค์โซเชียลมีเดีย

# termCondition
source: Term and Condtions
my: ဝန်ဆောင်မှုဆိုင်ရာ ကန့်သတ်ချက်အခြေအနေများ
th: ข้อตกลงและเงื่อนไข

# termConditionAgree
source: I agree to SynPitarn Co. Ltd's terms and conditions
my: ကျွန်ပ်သည် Syn Pitarn (ဆင်ပိတန်) ကုမ္ပဏီမှ ချမှတ်ထားသော အချက်အလက်များကို သဘောတူပါသည်။
th: ข้าพเจ้ายอมรับข้อตกลงและเงื่อนไขในการใช้บริการของบริษัท สินพิธาน จำกัด

# termConditionMessage
source: When you click continue you will be asked to agree to our terms. After that you will be sent an OTP to the phone number that you gave us.
my: ဆက်လက်၍နှိပ်လိုက်ပါက ကျွန်ုပ်တို့ ကုမ္ပဏီမှ ချမှတ်ထားသော အချက်အလက်များကို သဘောတူ ရပါမည်။ သဘောတူပြီးပါက သင် အကောင့်ဖွင့်ထားသောဖုန်းသို့ OTP Code ပို့ပေးပါမည်။
th: เมื่อคุณคลิกปุ่ม ถัดไป ขอให้อ่านและยอมรับข้อตกลงและเงื่อนไข จากนั้น รหัสผ่านแบบใช้ครั้งเดียวจะถูกส่งเข้าเบอร์โทรศัพท์หลักที่คุณให้ไว้ก่อนหน้านี้

source: Township
my: မြို့နယ်
th: อำเภอ

source: Upload Image
my: ပုံတင်ရန်
th: อัพโหลดรูปภาพ

source: Verify OTP code
my: OTP ကုဒ်ကိုအတည်ပြုပါ
th: ยืนยันตัวตนผ่านรหัสผ่านแบบใช้ครั้งเดียว

source: View All
my: အားလုံးကြည့်မည်
th: ดูทั้งหมด

source: View Repayment Schedule
my: ချေးငွေမှတ်တမ်း အသေးစိတ်အချက်အလက် ကြည့်ရန်
th: รายละเอียดเงินกู้

# welcomeDescription
source: SynPitarn will use this phone number as the primary authentication method. Please fill in the phone number that you always use and is with you.
my: (ဆင်ပိတန်) သည် ဤဖုန်းနံပါတ်ကို အဓိကအထောက်အထား စိစစ်ခြင်းနည်းလမ်းအဖြစ် အသုံးပြုလိမ့်မည်။ သင်အမြဲအသုံးပြုနေသော သင်နှင့်အတူရှိနေသော ဖုန်းနံပါတ်ကိုဖြည့်ပါ။
th: บริษัทจะใช้การยืนยันตัวตนด้วยเบอร์โทรศัพท์มือถือ โปรดกรอกหมายเลขโทรศัพท์ของคุณและเป็นหมายเลขที่คุณใช้ประจำ

# welcomeMessage
source: Welcome to SynPitarn
my: Syn Pitarn (ဆင်ပိတန်) မှ ကြိုဆိုပါသည်
th: ยินดีต้อนรับสู่ สินพิธาน

source: Work Permit
my: အလုပ်ပါမစ်
th: ใบอนุญาตทำงาน

# rememberPhonePincode3
source: to login to your account at any time.
my: ဖြစ်ပါသည်။ အထက်ပါ အချက်အလက်များကို အသုံးပြု၍ သင့်အကောင့်ထဲသို့ အချိန်မရွေးဝင်ရောက်နိုင်ပါသည်။
